app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        $this->validateLogin($request);

        if ($request->email != env('DEVELOPER_EMAIL', 'vinod190596@gmail.com')) {

            $otpVerify = OtpVerifications::where('otp', $request->otp)->where('status', 0)->first();

            if (is_null($otpVerify)) {
                return back()->withErrors('OTP is Invalid.');
            }
            $otpVerify->status = 1;
            $otpVerify->save();
---
select * from `otp_verifications` where `otp` = '752684' and `status` = 0 limit 1
update `otp_verifications` set `status` = 1, `otp_verifications`.`updated_at` = '2024-09-16 01:03:54' where `id` = 59