app/Services/TextlocalService.php

insert into `otp_verifications` (`type`, `credential`, `otp`, `updated_at`, `created_at`) values ('mobile', '9335171302', 927234, '2024-09-15 20:25:10', '2024-09-15 20:25:10')
---
    public function sendSms($numbers, $otp)
    {
        $client = new Client();

        $message = rawurlencode('Dear user%nYour OTP for sign up to Career without Barrier portal is ' . $otp . '.%nValid for 10 minutes. Please do not share this OTP.%nRegards%nCareer without Barrier Team');

        $data = [
            'apikey' => $this->apiKey,
            'numbers' =>  $numbers,
            'sender' => $this->sender,
            'message' => $message,
        ];

        $response = $client->post('https://api.textlocal.in/send/', [
            'form_params' => $data,
            'verify' => false
        ]);

        $response = json_decode($response->getBody()->getContents());

        if ($response) {
            $otpVerifications               = new OtpVerifications();
            $otpVerifications->type         = 'mobile';
            $otpVerifications->credential   = $numbers;
            $otpVerifications->otp          = $otp;
            $saveToDb                       = $otpVerifications->save();