app/Exports/StudentsSubjectMarkFillExport.php

    public function __construct($subjectMapping)
    {
        $this->students = Student::where('scholarship_category', $subjectMapping->education_type_id)
            ->whereIn('scholarship_opted_for', json_decode($subjectMapping->name))
            ->with(['latestStudentCode', 'scholarShipCategory'])
            ->get();
---
select * from `education_type` where `education_type`.`id` in (61) and `education_type`.`deleted_at` is null
select * from `students` where `scholarship_category` = 61 and `scholarship_opted_for` in (188, 189, 190, 191, 192)

    public function map($row): array
    {
        $allSubjects = [];

        foreach ($this->subjects as $subject) {
            $allSubjects[] = $subject->name;
        }

        $studPaperExporteds = StudentPaperExported::where('student_id', $row->id)->where('app_code', $row->latestStudentCode?->application_code)->orderBy('subject_id')->get();

        if ($studPaperExporteds->isEmpty()) {
            foreach ($this->subjects as $subject) {

                $subjectPaper = DB::table('subject_paper_details')
                ->where('subject_mapping_id',$this->subjectMapping->id)
                ->where('subject_id', $subject->id)->get();

                $studPaperExporteds = new StudentPaperExported;
                $studPaperExporteds->student_id = $row->id;
                $studPaperExporteds->subject_mapping_id = $this->subjectMapping->id;
                $studPaperExporteds->app_code = $row->latestStudentCode?->application_code;
                $studPaperExporteds->subject_id = $subject->id;
                $studPaperExporteds->subject_name = $subject->name;
                $studPaperExporteds->max_marks = $subjectPaper->sum('max_marks');
                $studPaperExporteds->save();
            }
        }

        return [
            $this->rowNumber++,
            $studPaperExporteds->first()?->id,
            ucfirst($row->name),
            $row->father_name,
            $row->gender == 'Male' ? 'M' : ($row->gender == 'Female' ? 'F' : 'T'),
            Date::dateTimeToExcel(Carbon::parse($row->dob)),
            $row->state?->name,
            $row->district?->name,
            $row->latestStudentCode?->application_code,
            $row->latestStudentCode?->roll_no,
            $row->scholarShipCategory?->name,
            '',
            ''
        ];
---
select * from `student_paper_exporteds` where `student_id` = 1 and `app_code` = 'KAN31140' order by `subject_id` asc
select * from `subject_paper_details` where `subject_mapping_id` = 26 and `subject_id` = 97
insert into `student_paper_exporteds` (`student_id`, `subject_mapping_id`, `app_code`, `subject_id`, `subject_name`, `max_marks`, `id`, `updated_at`, `created_at`) values (1, 26, 'KAN31140', 97, 'Hindi', 0, '9d042ea3-d4ef-4eb0-9429-9129eff3cc0f', '2024-09-15 20:37:59', '2024-09-15 20:37:59')
select `id`, `name` from `states` where `states`.`id` = 34 limit 1
select * from `student_paper_exporteds` limit 1