app/Listeners/paymentDoneListener.php

select * from `users` where `roles` = 'admin' and `email` is not null
---
    public function handle(object $event): void
    {
        $studentCode = $event->studCode;

        $student = $studentCode->student;

        $admins = User::where('roles', 'admin')->whereNotNull('email')->get();