app/Http/Controllers/AdminController.php

    public function index()
    {

        $newStudents = Student::whereHas('latestStudentCode', function ($query) {
            $query->whereNull('roll_no');
        })->count();
        $appliedCount = CouponCode::select('id')->where('is_applied', 1)->count();
        $newInstituteInquiry = Corporate::where('is_approved', 0)->whereNull('signup_at')->select('id')->count();

        $data = [
            'newStudents' => $newStudents,
            'appliedCount' => $appliedCount,
            'newInstituteInquiry' => $newInstituteInquiry,

            'student' => Student::count(),
            'contactInfo' => ContactInfo::count(),
            'APPinsititute' => Corporate::where('is_approved', 1)->where('signup_approved', 1)->whereNotNull('signup_at')->count(),
            'insititute' => Corporate::where('is_approved', 0)->whereNull('signup_at')->count(),
            'subjects' => Subject::count(),
            'testimonials' => TestimonialsModel::count(),
---
select count(*) as aggregate from `coupon_codes` where `is_applied` = 1
select count(*) as aggregate from `corporates` where `is_approved` = 0 and `signup_at` is null
select count(*) as aggregate from `students`
select count(*) as aggregate from `contact_infos`
select count(*) as aggregate from `corporates` where `is_approved` = 1 and `signup_approved` = 1 and `signup_at` is not null
select count(*) as aggregate from `subjects` where `subjects`.`deleted_at` is null
select count(*) as aggregate from `testimonials`

    public function studentList(Request $request)
    {
        $scholarshipTypes = Educationtype::get();

        $cities = District::get();

        $query = Student::query();

        $classes = collect();

        $query->where('is_final_submitted', 1);

        if ($request->isMethod('POST')) {

            if (!empty($request->district_id)) {
                $query->whereIn('district_id', $request->district_id);
            }

            if (!empty($request->gender)) {
                $query->whereIn('gender', $request->gender);
            }

            if (!empty($request->class)) {
                $query->whereIn('qualification', $request->class);
                $classes = BoardAgencyStateModel::whereIn('id', $request->class)->select('id', 'name')->get();
            }

            $students = $query->with('latestStudentCode')->get();
        } else {
            $students = $query->with('latestStudentCode')->get();
---
select * from `education_type` where `education_type`.`deleted_at` is null
select * from `districts`
select * from `student_codes` where `student_codes`.`stud_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 18, 19, 21)
select * from `students` where `is_final_submitted` = 1

    public function studentRollList(Request $request)
    {
        $scholarshipTypes = Educationtype::get();

        $cities = District::get();

        $query = Student::query();

        $classes = collect();

        $query->where('is_final_submitted', 1);

        if ($request->isMethod('POST')) {

            if (!empty($request->district_id)) {
                $query->whereIn('district_id', $request->district_id);
            }

            if (!empty($request->gender)) {
                $query->whereIn('gender', $request->gender);
            }

            if (!empty($request->class)) {
                $query->whereIn('qualification', $request->class);
                $classes = BoardAgencyStateModel::whereIn('id', $request->class)->select('id', 'name')->get();
            }

            $students = $query->with('latestStudentCode')->get();
        } else {
            $students = $query->with('latestStudentCode')->get();
---
select * from `education_type` where `education_type`.`deleted_at` is null
select * from `districts`
select * from `students` where `is_final_submitted` = 1

    public function examCenterAllotment(Request $request)
    {
        $scholarshipTypes = Educationtype::get();

        $cities = District::get();

        $examCenters = Center::get();
---
select * from `education_type` where `education_type`.`deleted_at` is null
select * from `districts`
select * from `centers`

                $query->limit(intval($request->student_number));
            }

            $students = $query->with('studentCode')->get();
---
select * from `student_codes` where `student_codes`.`stud_id` in (1, 2, 3, 4, 5, 7, 8, 10, 21, 25, 27, 28, 30, 31, 32, 33, 35, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 49, 50, 51, 52, 53, 54, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 95, 96, 97, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123)

            session()->flash('gender');
            session()->flash('qualification');
            session()->flash('education_name');
            $students = $query->with('studentCode')->get();
---
select * from `student_codes` where `student_codes`.`stud_id` in (1, 2, 3, 4, 5, 7, 8, 10, 21, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123)

    public function examCenterAllot(Request $request)
    {
        // return response()->json(['status' => false, 'message' => json_encode($request->input())]);
        // return print_r($request->input());
        $examCenter = $request->exam_center;
        $studentNumber = $request->student_number;

        $students = Student::where('is_final_submitted', 1)->limit($studentNumber)->get();
---
select * from `students` where `is_final_submitted` = 1 limit 0

    public function examCenterAllottoAll($exam_center, Request $request)
    {

        $query = Student::where('is_final_submitted', 1);
        if ($request->student_number && intval($request->student_number)) {
            $query->limit(intval($request->student_number));
        }
        $students = $query->get();

        $nullCountStudent = 0;
        if ($students->isNotEmpty()) {
            $students->load(['district', 'qualifications', 'studentCode']);
---
select * from `students` where `is_final_submitted` = 1
select * from `student_codes` where `student_codes`.`stud_id` in (1, 2, 3, 4, 5, 7, 8, 10, 21, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123)

    public function studentResult(Request $request)
    {

        $scholarshipTypes = Educationtype::get();
---
select * from `education_type` where `education_type`.`deleted_at` is null