app/Http/Controllers/AdminController.php

    public function studentGenerateRollNo(Request $request)
    {
        // return response()->json($request->all());
        // Fetch students based on final submission and include district relation
        $students = Student::where('is_final_submitted', 1)
            ->whereIn('district_id', $request->district_id)  // Fetch students from selected districts
            ->with('district');

        // Apply filters based on scholarship, class, and gender
        if (!empty($request->scholarship_type) && $request->scholarship_type[0] != null) {
            $scholarshipIds = array_map('intval', $request->scholarship_type);
            $students = $students->whereHas('scholarShipCategory', function ($subQuery) use ($scholarshipIds) {
                $subQuery->whereIn('id', $scholarshipIds);
            });
        }

        if (!empty($request->class) && $request->class[0] != null) {
            $classIds = array_map('intval', $request->class);
            $students = $students->whereIn('qualification', $classIds);
        }

        if (!empty($request->gender) && $request->gender[0] != null) {
            $genderIds = array_map('intval', $request->gender);
            $students = $students->whereIn('gender', $genderIds);
        }

        // Get the students after applying filters
        $students = $students->get();
---
select * from `students` where `is_final_submitted` = 1

    public function rollNumberGenerate($student, &$lastRollNumber)
    {
        $studentCode = $student->latestStudentCode;

        // Assign roll number only if the student does not already have one
        if (!$studentCode->roll_no) {
            $lastRollNumber++;  // Increment the last roll number
            $studentCode->roll_no = sprintf('%08d', $lastRollNumber);  // Format roll number as 8 digits
            $studentCode->save();
---
update `student_codes` set `roll_no` = '14900034', `student_codes`.`updated_at` = '2024-09-15 06:27:39' where `id` = 17