app/Http/Controllers/ExamsController.php

                $nameJson = str_replace('"','',json_encode($name));

                // Create a new mapping entry and save it to the database
                $mappId = GnResultSubjectMapping::create([
                    'education_type_id' => $educationTypeId,
                    'classes_group_exams_id' => $classesGroupExamsId,
                    'agency_board_university_id' => $agencyBoardUniversityId,
                    'name' => $nameJson,
                    'subject_id' => $subjectIdJson,
                ])->id;

                foreach($subjectIds as $sub){
                    $subject = Subject::find($sub);
---
insert into `gn_result_subject_mappings` (`education_type_id`, `classes_group_exams_id`, `agency_board_university_id`, `name`, `subject_id`, `updated_at`, `created_at`) values ('61', '236', '160', '[171,172,173,174,175,176]', '[97,98,101,103,104]', '2024-09-15 14:27:27', '2024-09-15 14:27:27')
select * from `subjects` where `subjects`.`id` = '97' and `subjects`.`deleted_at` is null limit 1

        $this->data['classes'] = ClassGoupExamModel::get();
        $this->data['subjects'] = Subject::get();

        $this->data['exams']    =   Gn_AssignClassGroupExamName::all()->groupBy('education_type_id');
        // dd($this->data['exams']);
        $educations = Educationtype::get();
---
select * from `gn__assign_class_group_exam_names`
select * from `education_type` where `education_type`.`deleted_at` is null


        $this->data['class_data'] = ClassGoupExamModel::get();

        $this->data['exam'] = Gn_DisplayClassGroupExamName::get();
        // $this->data['exam'] = Gn_DisplayClassGroupExamName::first();
        $this->data['gn_exam_agency_board'] = Gn_DisplayExamAgencyBoardUniversity::get();
        $this->data['board_data'] = Gn_EducationClassExamAgencyBoardUniversity::get();
        $this->data['gn_other_exam_classes'] = Gn_OtherExamClassDetailModel::get();
        $this->data['subjects'] = Subject::get();
        $this->data['other_exam_classes'] = Gn_DisplayOtherExamClassDetail::get();

        $this->data['resultSubjectMappings'] = GnResultSubjectMapping::with('subjectPaperDetails')->orderBy('created_at','asc')->get();
---
select * from `gn__display_class_group_exam_names`
select * from `gn__display_exam_agency_board_universities`
select * from `gn__education_class_exam_agency_board_universities`
select * from `gn__other_exam_class_detail_models`
select * from `gn__display_other_exam_class_details`
select * from `gn_result_subject_mappings` order by `created_at` asc
select * from `subject_paper_details` where `subject_paper_details`.`subject_mapping_id` in (24) order by `created_at` asc