app/Http/Controllers/ExamsController.php

select * from `education_type` where `education_type`.`deleted_at` is null
---
    public function __construct()
    {
        $this->data = array();

        $this->data['educations']       = EducationType::get();

select * from `subjects` where `subjects`.`deleted_at` is null
---
                ])->id;

                foreach ($subjectIds as $sub) {
                    $subject = Subject::find($sub);

select * from `other_category_class` where `other_category_class`.`deleted_at` is null
---

                $otherMd = new OtherCategoryClass();
                if ($inputs['id'] > 0) {
                    $otherMd = OtherCategoryClass::find($inputs['id']);

select * from `subjects` where `subjects`.`deleted_at` is null
select * from `gn__assign_class_group_exam_names`
select * from `education_type` where `education_type`.`deleted_at` is null
---
        }

        $this->data['classes'] = ClassGoupExamModel::get();
        $this->data['subjects'] = Subject::get();

        $this->data['exams']    =   Gn_AssignClassGroupExamName::all()->groupBy('education_type_id');

        $educations = EducationType::get();

select * from `other_category_class` where `other_category_class`.`deleted_at` is null
---
        $boards = BoardAgencyStateModel::get();

        $this->data['boards'] = $boards;
        $others = OtherCategoryClass::get();

select * from `gn__display_class_group_exam_names`
select * from `gn__display_exam_agency_board_universities`
select * from `gn__education_class_exam_agency_board_universities`
select * from `gn__other_exam_class_detail_models`
select * from `subjects` where `subjects`.`deleted_at` is null
select * from `gn__display_other_exam_class_details`
select * from `gn_result_subject_mappings` order by `created_at` asc
select * from `subject_paper_details` where `subject_paper_details`.`subject_mapping_id` in (24, 26) order by `created_at` asc
---

        $this->data['class_data'] = ClassGoupExamModel::get();

        $this->data['exam'] = Gn_DisplayClassGroupExamName::get();

        $this->data['gn_exam_agency_board'] = Gn_DisplayExamAgencyBoardUniversity::get();
        $this->data['board_data'] = Gn_EducationClassExamAgencyBoardUniversity::get();
        $this->data['gn_other_exam_classes'] = Gn_OtherExamClassDetailModel::get();
        $this->data['subjects'] = Subject::get();
        $this->data['other_exam_classes'] = Gn_DisplayOtherExamClassDetail::get();

        $this->data['resultSubjectMappings'] = GnResultSubjectMapping::with('subjectPaperDetails')->orderBy('created_at', 'asc')->get();