app/Http/Controllers/HomeController.php

select * from `slider` where `status` = 1
select * from `govtwebsite` where `status` = 1
select * from `blog_news` where `status` = 1
select * from `notifications` where `status` = 1
select * from `education_type` where `is_featured` = 1 and `education_type`.`deleted_at` is null
select * from `our_journeys` where `is_featured` = 1
select * from `our_contributors` where `is_featured` = 1
select * from `benefits` where `is_featured` = 1
select * from `testimonials` where `status` = 1 and `type` = 'student'
select * from `testimonials` where `status` = 1 and `type` = 'corporate'
select * from `terms_conditions` where `status` = 1 and `type` = 'institute' order by `created_at` asc limit 1
---
    public function index()
    {
        $sliders = SliderModel::where('status', 1)->get();

        $govtwebsites =  GovtwebsiteModel::where('status', 1)->get();

        $blogNews =  BlognewsModel::where('status', 1)->get();

        $notifications =  NotificationModel::where('status', 1)->get();

        $courses =  CourseDetailsModel::where('status', 1)->select('id', 'title', 'course_logo')->get();

        $educations = Educationtype::where('is_featured', 1)->get();

        $ourJourneys = OurJourney::where('is_featured', 1)->get();

        $ourContributors = OurContributor::where('is_featured', 1)->get();

        $benefits = BenefitsModel::where('is_featured', 1)->get();

        $studentTestimonials = TestimonialsModel::where('status', 1)->where('type', 'student')->get();

        $corporateTestimonials = TestimonialsModel::where('status', 1)->where('type', 'corporate')->get();

        $institudeTermsCondition = TermsCondition::where('status', 1)->where('type', 'institute')->orderBy('created_at')->first();

select * from `users` where `roles` = 'admin' and `email` is not null
insert into `otp_verifications` (`credential`, `otp`, `type`, `updated_at`, `created_at`) values ('9335171302', 927234, 'mobile', '2024-09-15 20:25:10', '2024-09-15 20:25:10')
---
    public function sendVerificationOtp(Request $request)
    {


        $textlocal = new TextlocalService;

        if ($request->form_user == 'admin') {

            if ($request->email == env('DEVELOPER_EMAIL', 'vinod190596@gmail.com')) {
                return;
            }

            $admins = User::where('roles', 'admin')->whereNotNull('email')->get();

            $otp   = mt_rand(100000, 999999);

            $textlocal->sendSms(env('ADMIN_MOBILE', '9335171302'), $otp);

            $ipAddress = $request->ip();
            $userAgent = $request->userAgent();

            $votp = new OtpVerifications;

            $votp->credential = env('ADMIN_MOBILE', '9335171302');
            $votp->otp = $otp;
            $votp->type = 'mobile';
            $votp->save();

select * from `mobile_numbers` where `mobile` = '9812345678' and `isOtpRequired` = 1 limit 1
---

        $time = date('Y-m-d H:i:s', strtotime('-10 minutes'));

        $verifiedMobile = MobileNumber::where('mobile', $mobileNumber)->where('isOtpRequired', 1)->first();

select * from `otp_verifications` where `credential` = '9812345678' and `created_at` >= '2024-09-15 03:53:18' limit 1
---
            return response()->json(['status' => true, 'message' => 'Otp Verified Successfully.']);
        }

        $otpVerifications = OtpVerifications::where('credential', $mobileNumber)
            ->where('created_at', '>=', $time)
            ->first();

update `otp_verifications` set `status` = 1, `otp_verifications`.`updated_at` = '2024-09-15 04:03:18' where `id` = 52
---
            }

            $otpVerifications->status = 1;
            $otpVerifications->save();