app/Http/Controllers/InternalRequestsController.php

select * from `gn__other_exam_class_detail_models` where `education_type_id` = '61' and `classes_group_exams_id` = '236' and `agency_board_university_id` = '161'
---

            if ($request->input('form_name') == 'get_agency_board_qualification') {

                    $agency_board_university = Gn_OtherExamClassDetailModel::where('education_type_id', $request->scholarshipCat)->where('classes_group_exams_id', $request->educationType)->where('agency_board_university_id',$request->qualification)->get();

select * from `gn_result_subject_mappings` where `gn_result_subject_mappings`.`id` = '25' limit 1
delete from `student_paper_exporteds` where `subject_mapping_id` = '25'
delete from `subject_paper_details` where `subject_mapping_id` = '25'
---
            }

            if ($request->input('form_name') == 'deleteresultSubjectMap') {
                $model = GnResultSubjectMapping::find($request->id);

                DB::table('student_paper_exporteds')->where('subject_mapping_id',$request->id)->delete();
                DB::table('subject_paper_details')->where('subject_mapping_id',$request->id)->delete();