app/Http/Controllers/StudentController.php

select * from `category`
select * from `states`
---
    public function studentform()
    {
        $student = Auth::guard('student')->user();
        $categories = Category::all();
        $states = State::all();

select * from `terms_conditions` where `status` = 1 and `type` = 'student' order by `created_at` asc limit 1
---
    public function additionalDetailsCreate(Request $request)
    {
        $student = Auth::guard('student')->user();

        $termsCondition = TermsCondition::where('status', 1)->where('type', 'student')->orderBy('created_at')->first();

select * from `states`
select * from `terms_conditions` where `status` = 1 and `type` = 'student' order by `created_at` asc limit 1
---
    public function form_review()
    {
        $student = Auth::guard('student')->user();
        $states = State::all();

        $termsCondition = TermsCondition::where('status', 1)->where('type', 'student')->orderBy('created_at')->first();

select * from `districts` where `state_id` = 29
---
    public function addQualificationsCreate(Request $request)
    {
        $student = Auth::guard('student')->user();
        $city = District::where('state_id', $student->state_id)->get();

select * from `students` where `students`.`id` = 21 limit 1
update `students` set `form_step` = 4, `is_final_submitted` = 1, `name_checked` = '1', `father_name_checked` = '1', `dob_checked` = '1', `mobile_checked` = '1', `email_checked` = '1', `qualification_checked` = '1', `scholarship_category_checked` = '1', `scholarship_opted_for_checked` = '1', `choiceCenterA_checked` = '1', `choiceCenterB_checked` = '1', `students`.`updated_at` = '2024-09-15 04:23:40' where `id` = 21
---
    public function finalSubmit(Request $request)
    {
        $student = Student::find(Auth::guard('student')->id());
        $validated = $request->validate([
            'name_checked' => 'required',
            'father_name_checked' => 'required',
            'dob_checked' => 'required',
            'mobile_checked' => 'required',
            'email_checked' => 'required',
            'qualification_checked' => 'required',
            'scholarship_category_checked' => 'required',
            'scholarship_opted_for_checked' => 'required',
            'choiceCenterA_checked' => 'required',
            'choiceCenterB_checked' => 'required',
        ]);

        try {
            DB::beginTransaction();
            $student->forceFill($validated);
            if ($student->form_step == 3) {
                $student->form_step = 4;
            }

            $student->is_final_submitted = 1;
            $student->save();

insert into `student_codes` (`application_code`, `stud_id`, `updated_at`, `created_at`) values ('DHO31183', 21, '2024-09-15 04:23:40', '2024-09-15 04:23:40')
---
                $studentCode->stud_id = $student->id;
            }
            $studentCode->application_code = $this->generateAppCode($student);
            $studentCode->save();

select * from `application_code_list` order by `last_app_code` desc limit 1
select * from `application_code_list` where `city` = 'Dholpur' order by `last_app_code` desc limit 1
insert into `application_code_list` (`city`, `last_app_code`, `updated_at`, `created_at`) values ('Dholpur', 31183, '2024-09-15 04:23:40', '2024-09-15 04:23:40')
---
    public function generateAppCode($student)
    {
        try {
            DB::beginTransaction();

            $city = $student->district->name;
            $cityPrefix = strtoupper(substr($city, 0, 3));

            // Check if the city already exists in the roll_numbers table
            $appCodeRecord = ApplicationCodeList::orderBy('last_app_code', 'desc')->first();

            if ($appCodeRecord) {
                $existCityAppCodeList = ApplicationCodeList::where('city', $city)->orderBy('last_app_code', 'desc')->first();

                if ($existCityAppCodeList) {
                    $defaultStartNumber = $appCodeRecord->last_app_code;
                    $defaultStartNumber = $defaultStartNumber + 1;
                } else {
                    $defaultStartNumber = $appCodeRecord->last_app_code;
                    $additionalIncrement = 20;
                    $defaultStartNumber = $defaultStartNumber + $additionalIncrement;
                }
                $appCodeRecord = new ApplicationCodeList();
                $appCodeRecord->city = $city;
                $appCodeRecord->last_app_code = $defaultStartNumber;
                $appCodeRecord->save();

select * from `student_paper_exporteds` where `app_code` = 'DHO31279' and `student_id` = 118
---
    public function resultDownload()
    {
        $student = Auth::guard('student')->user();
        $appCode = $student->latestStudentCode;


        $studentPaperDetails = StudentPaperExported::with('subjectPaperDetail')->where('app_code', $appCode?->application_code)->where('student_id', $student->id)->get();

select * from `education_type` where `education_type`.`id` in (62) and `education_type`.`deleted_at` is null
select * from `gn__display_exam_agency_board_universities` where `board_id` LIKE '%159%'
---
    public function getScholarshipCategory($id, $type = null)
    {

        if ($type == 'Yes') {
            $education = EducationType::where('id', $id)->get();

            return response()->json(['status' => true, 'message' => 'Select another Qualification.', 'data' => $education]);
        }
        $boardConnection = Gn_DisplayExamAgencyBoardUniversity::where('board_id', 'LIKE', '%' . $id . '%')
            ->with('educations')
            ->get();

select * from `students` where `students`.`id` = 118 limit 1
update `students` set `terms_conditions_scholarship` = '1', `students`.`updated_at` = '2024-09-16 02:43:03' where `id` = 118
select * from `student_claim_forms` where `student_id` = 118 limit 1
---
    public function claimScholarshipForm(Request $request)
    {
        $student = Student::find(Auth::guard('student')->id());

        if ($request->isMethod('POST')) {
            $request->validate([
                'terms_conditions_scholarship' => 'required'
            ], [
                'terms_conditions_scholarship.required' => 'The Term and Condition is required.'
            ]);

            $student->terms_conditions_scholarship = $request->terms_conditions_scholarship;
            $student->save();
        }
        $cities = $student->state?->districts;
        $claimForm = StudentClaimForm::where('student_id', $student->id)->first();