app/Models/GnResultSubjectMapping.php

    public function subjects($name = null)
    {
        $subjectIds = json_decode($this->subject_id, true);
        $subject = collect();

        if (is_array($subjectIds)) {
            $subject = Subject::whereIn('id', $subjectIds)->get();
---
select * from `subjects` where `id` in (97, 98, 101, 103, 104) and `subjects`.`deleted_at` is null